IDEA StatiCa Open Model
MatConcreteSIA Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatConcreteSIA type exposes the following members.
Properties
Name | Description
AggregateType
 type of aggregate
CalculateDependentValues
 setting calculation dependent values on fck
CementClass
 type of cement class
DiagramType
 type of stress-strain diagram bilinear/parabolic/general for ULS calculation
E
 Young's modulus
 (Inherited from Material.)
Ecm
 secant modulus of elasticity of concrete
Epsc1d
 compressive strain in the concrete
Epsc2d
 compressive strain in the concrete
Fck
 characteristic compressive cylinder strength of concrete at 28 days
Fcm
 mean value of concrete cylinder compressive strength
Fctk_0_05
 characteristic axial tensile strength of concrete 5% quantile
Fctk_0_95
 characteristic axial tensile strength of concrete 95% quantile
Fctm
 mean value of axial tensile strength of concrete
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
LoadFromLibrary
 Load from library - try override properties from library find material by name
 (Inherited from Material.)
Name
 Name of material
 (Inherited from Material.)
Nfc
 conversion factor nfc
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
PlainConcreteDiagram
 Stress strain diagram with tension part
Poisson
 Poisson's ratio
 (Inherited from Material.)
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
StoneDiameter
 diameter of stone
Tck
 characteristic value of the shear stress limit
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
UnitMass
 Unit weight
 (Inherited from Material.)
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
See Also
Reference
MatConcreteSIA Class
IdeaRS.OpenModel.Material Namespace